---
kind: method
id: M:Autodesk.Revit.UI.TextBoxData.#ctor(System.String)
source: html/3d85c12a-7b46-49d9-aed7-a120f1951e2f.htm
---
# Autodesk.Revit.UI.TextBoxData.#ctor Method

Constructs a new instance of TextBoxData.

## Syntax (C#)
```csharp
public TextBoxData(
	string name
)
```

## Parameters
- **name** (`System.String`) - The internal name of the TextBoxData.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - Thrown when Nothing nullptr a null reference ( Nothing in Visual Basic) is passed for name.
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when an empty string is passed for name.